SAKET71193/pic24fj256gb606/rtcc.c
#include"usr_rtcc.h"
#include<xc.h>
#include <p24FJ256GB606.h>


/*********************************************************************
 Function:        void RtccInitClock_v2(void)
 
    Overview : For seamless migration, it is recommended to call the above function as "RtccInitClock".

 PreCondition:    None
                  
 Input:           None
 
 Output:          None
 
 Side Effects:    None
 
 Overview:        The function initializes the RTCC device. It starts the RTCC clock,
                  sets the RTCC Off and disables RTCC write. Disables the OE.
                   
 Note:            None
 ********************************************************************/
void RtccInitClock(void)
{
   // enable the Secondary Oscillator
   __builtin_write_OSCCONL(OSCCON | 0x2); //saket check
   
   RTCCON1L = 0x0;
   
   if(mRtccIsOn())
   {
      if(!mRtccIsWrEn())
      {
          RtccWrOn();
      }
      mRtccOff();
   }
   
   mRtccWrOff();
}

/*********************************************************************
  Function:        void RtccWrOn_v2(void)
  
 Overview : For seamless migration, it is recommended to call the above function as "RtccWrOn".
 
  PreCondition:    None
 
  Input:           None
 
  Output:          None
 
  Side Effects:    None
 
  Overview:        Function to set the RCFGCAL.RTCWREN
 
  Note:            The interrupts are disabled in order to have a proper 
                   device initialization
 ********************************************************************/
void RtccWrOn(void)
{
   UINT8  CPU_IPL;
   unsigned register int data;

/* Disable Global Interrupt */
   SET_AND_SAVE_CPU_IPL(CPU_IPL,7);
  //saket check
  
   asm volatile ("MOV #0x55,%0" : "=r"(data));
   asm volatile ("MOV %0,NVMKEY" : : "r"(data)); // Write the 0x55 key
   asm volatile ("MOV #0xAA,%0" : "=r"(data));
   asm volatile ("MOV %0,NVMKEY"  : : "r"(data)); // Write the 0xAA key

   mRtccWrOn();  

/* Enable Global Interrupt */
   RESTORE_CPU_IPL(CPU_IPL);
}

#define done 0
#if done

/**********************************************************************************************
 Function:         void RtccSetCalibration_v2(int drift)
 
   Overview : For seamless migration, it is recommended to call the above function as "RtccSetCalibration". 
 
 PreCondition:     drift has to fit into signed 8 bits representation 
 
 Input:            drift - value to be added/subtracted to perform calibration 
 
 Output:           None
 
 Side Effects:     None
 
 Overview:         The function updates the value that the RTCC uses in the
                   auto-adjust feature, once every minute.
                   The drift value acts as a signed value, [-128*4, +127*4], 0 not having
                   any effect.
                   
 Note:             Writes to the RCFGCAL.CAL[7:0] register should  only occur when the timer
                   is turned off or immediately or after the edge of the seconds pulse
                   (except when SECONDS=00 - due to the possibility of the auto-adjust event).
                   In order to speed-up the process, the API function performs the reading
                   of the HALFSEC field.
                   The function may block for half a second, worst case, when called
                   at the start of the minute.
                   Interrupts can not be disabled for such a long period. However, long 
                   interrupt routines can interfere with the proper functioning of the
                   device.Care must be taken.
 ***********************************************************************************************/
void RtccSetCalibration_v2(int drift)
{
   if(mRtccIsOn())
   {
       UINT16  currSec;
       RCFGCAL1 &= ~RCFGCAL_MASK_RTCPTR;     // make sure you read seconds
       if(((currSec=RTCVAL)&0xff)==00)
       {   // we're at second 00, wait auto-adjust to be performed
           while(!RCFGCAL1bits.HALFSEC); // wait until second half...
       }
   }
   
   // update the CAL value
   RCFGCAL1bits.CAL=drift;
}

#endif
 /*********************************************************************
  Function:        void RtccReadDate_v1(rtccDate* pDt)

  PreCondition:    pDt a valid pointer
 
  Input:           pDt - pointer to a rtccTime union to store the current time
 
  Output:          None
 
  Side Effects:    None
 
  Overview:        The function updates the user supplied union/structure with
                   the current time of the RTCC device.
 
  Note:            The function makes sure that the read value is valid.
                   It avoids waiting for the RTCSYNC to be clear by 
                   performing successive reads.
 ********************************************************************/
void RtccReadDate(rtccDate* pDt)
{
   rtccTimeDate rTD0;

   rTD0.w[2]= DATEL;
   rTD0.w[3]|= DATEH;
    
   pDt->f.mday= rTD0.f.mday;
   pDt->f.mon = rTD0.f.mon;
   pDt->f.wday= rTD0.f.wday;
   pDt->f.year= rTD0.f.year;
}

 /*********************************************************************
  Function:        void RtccReadAlrmDate(rtccDate* pDt)

  PreCondition:    pDt a valid pointer
 
  Input:           pDt - pointer to a rtccDate union to store the alarm Date
 
  Output:          None
 
  Side Effects:    None
 
  Overview:        The function updates the user supplied union/structure with
                   the current alarm Date of the RTCC device. 
 ********************************************************************/

void RtccReadAlrmDate(rtccDate* pDt)
{
   rtccTimeDate rTD0;

   rTD0.w[2]=  ALMDATEL;
   rTD0.w[3]|= ALMDATEH;
    
   pDt->f.mday= rTD0.f.mday;
   pDt->f.mon = rTD0.f.mon;
   pDt->f.wday= rTD0.f.wday;
   pDt->f.year= rTD0.f.year;

}

 /*********************************************************************
  Function:        void RtccReadAlrmTime(rtccTime* pTm)
 
  PreCondition:    pTm a valid pointer
 
  Input:           pTm - pointer to a rtccTime union to store the alarm time
 
  Output:          None
 
  Side Effects:    None
 
  Overview:        The function updates the user supplied union/structure with
                   the current alarm time of the RTCC device.
 ********************************************************************/

