SAKET71193/pic24fj256gb606/rtcc.c
void RtccReadAlrmTime(rtccTime* pTm)
{
   rtccTimeDate rTD;

   
   rTD.w[0]=ALMTIMEL;
   rTD.w[1]=ALMTIMEH;  // read the user value

   pTm->f.hour=rTD.f.hour;
   pTm->f.min=rTD.f.min;
   pTm->f.sec=rTD.f.sec;    // update user's data
}

 /*********************************************************************
  Function:        void RtccReadAlrmTimeDate(rtccTimeDate* pTD)
 
  PreCondition:    None 
 
  Input:           pTD - pointer to a rtccTimeDate union to store the alarm time and date
 
  Output:          None
 
  Side Effects:    None
 
  Overview:        The function updates the user supplied union/structure with
                   the current alarm time and date of the RTCC device.
 
  Note:            None
 ********************************************************************/
void RtccReadAlrmTimeDate(rtccTimeDate* pTD)
{
   pTD -> w[0] = ALMTIMEL;  // read the user value
   pTD -> w[1] = ALMTIMEH;
   pTD -> w[2] = ALMDATEL;
   pTD -> w[3] = ALMDATEH;  // read the user value
}

 /*********************************************************************
  Function:        void RtccReadTime(rtccTime *pTm)
 
  PreCondition:    pTm a valid pointer
 
  Input:           pTm - pointer to a rtccTime union to store the current time
  
  Output:          None
  
  Side Effects:    None
  
  Overview:        The function updates the user supplied union/structure with
                   the current time of the RTCC device.                   
  
  Note:            The function makes sure that the read value is valid.
                   It avoids waiting for the RTCSYNC to be clear by 
                   performing successive reads.
 ********************************************************************/
void RtccReadTime(rtccTime* pTm)
{
   rtccTimeDate rTD0;
   rTD0.w[0]=TIMEL;
   rTD0.w[1]=TIMEH;    // read the user value
   
   pTm->f.hour=rTD0.f.hour;
   pTm->f.min=rTD0.f.min;
   pTm->f.sec=rTD0.f.sec;    // update user's data
}

/*********************************************************************
  Function:        void RtccReadTimeDate(rtccTimeDate* pTD)
 
  PreCondition:    None
 
  Input:           pTD - pointer to a rtccTimeDate union to store the current 
                        time and date
  Output:          None
  
  Side Effects:    None
  
  Overview:        The function updates the user supplied union/structure with
                   the current time and date of the RTCC device.
 
  Note:            This firmware solution would consist of reading each       
                   register twice and then comparing the two values. If the   
                   two values match, then a rollover did not occur.
 ********************************************************************/
void RtccReadTimeDate(rtccTimeDate* pTD)
{
      pTD->w[0]=TIMEL;
      pTD->w[1]=TIMEH;
      pTD->w[2]=DATEL;
      pTD->w[3]=DATEH;    // read the user value
}

/*********************************************************************
  Function:        void RtccSetAlarmRpt(rtccRepeat rpt, BOOL dsblAlrm)

  PreCondition:    rpt has to be a proper rtccRepeat enumeration value 
 
  Input:           rpt - value of the desired alarm repeat rate 
                   dsblAlrm - if TRUE, the API can temporarily disable
                              the alarm when changing the RPT value 
  Output:          None
  
  Side Effects:    None
  
  Overview:        The function sets the RTCC alarm repeat count.
  
  Note:            If alarm is enabled, changing the repeat count can be safely made
                   only when the sync pulse is unasserted. To avoid waiting for the sync
                   pulse, the user can choose to temporarily disable the alarm and then
                   re-enable it. This means that the user has the knowledge that an alarm
                   event is not imminent.
 ********************************************************************/
void RtccSetAlarmRpt(rtccRepeat rpt, BOOL dsblAlrm)
{
   BOOL    isAlrm=mRtccIsAlrmEnabled();

   if(isAlrm)
   {
       if(dsblAlrm)
       {
           mRtccAlrmDisable();
       }
       else
       {
           mRtccWaitSync();
       }
   }

   // update the repeat rate
    RTCCON1Hbits.AMASK = rpt;   
   
    // restore previous status
   if(isAlrm && dsblAlrm)
   {
       mRtccAlrmEnable();
   }
}

/****************************************************************************************
  Function:        void RtccSetAlarmRptCount(UINT8 rptCnt, BOOL dsblAlrm)
 
  PreCondition:    rptCnt has to be a value less then 255 
  
  Input:           rptCnt - value of the desired alarm repeat rate 
                   dsblAlrm - if TRUE, the API can temporarily disable
                              the alarm when changing the RPT value 
  Output:          None
  
  Side Effects:    None
  
  Overview:        The function sets the RTCC alarm repeat rate.
  
  Note:            rptCnt will be truncated to fit into 8 bit representation.
                   If alarm is enabled, changing the repeat count can be safely made
                   only when the sync pulse is unasserted. To avoid waiting for the sync
                   pulse, the user can choose to temporarily disable the alarm and then
                   re-enable it. This means that the user has the knowledge that an alarm
                   event is not imminent.
 ****************************************************************************************/
void RtccSetAlarmRptCount(UINT8 rptCnt, BOOL dsblAlrm)
{
   BOOL isAlrm= mRtccIsAlrmEnabled();

   if(isAlrm)
   {
       if(dsblAlrm)
       {
           mRtccAlrmDisable();
       }
       else
       {
           mRtccWaitSync();
       }
   }
   
   // update the repeat count value
   RTCCON1Hbits.ALMRPT =rptCnt;

   // restore previous status
   if(isAlrm && dsblAlrm)
   {
       mRtccAlrmEnable();
   }
   
}

/****************************************************************************************
 Function:        void RtccSetChimeEnable(BOOL enable, BOOL dsblAlrm)
 
 PreCondition:    None
 
 Input:           enable - boolean to enable/disable the RTCC chime
                  dsblAlrm - if TRUE, the API can temporarily disable
                             the alarm when changing the Chime status 
 Output:          None
 
 Side Effects:    None
 
 Overview:        The function enables/disables the chime alarm of the RTCC device.
 
 Note:            If alarm is enabled, changing the chime status can be safely made
                  when the sync pulse is unasserted. To avoid waiting for the sync
                  pulse, the user can choose to temporarily disable the alarm and then
                  re-enable it. This means that the user has knowledge that an alarm
                  event is not imminent.                  
 *****************************************************************************************/
void RtccSetChimeEnable(BOOL enable, BOOL dsblAlrm)
{
   BOOL    isAlrm=mRtccIsAlrmEnabled();

   if(isAlrm)
   {
       if(dsblAlrm)
       {
           mRtccAlrmDisable();
       }
       else
       {
           mRtccWaitSync();
       }
   }

   // update the chime status
   RTCCON1Hbits.CHIME=enable;

   // restore previous status
   if(isAlrm && dsblAlrm)
   {
       mRtccAlrmEnable();
   }
}

/*********************************************************************
 Function:        void RtccWriteAlrmDate(const rtccDate* pDt)
 
 PreCondition:    pDt a valid rtccDate pointer having proper values:
                      *	wday: BCD codification, 00-06 
                      *	mday: BCD codification, 01-31
                      *	mon: BCD codification, 01-12
 
 Input:           pDt - pointer to a constant rtccDate union
 
 Output:          None
 
 Side Effects:    None
 
