SAKET71193/pic24fj256gb606/rtcc.c
 Overview:        The function sets the alarm date in the RTCC device.
 
 Note:            The write is successful only if Wr Enable is set.
                  The function will enable the write itself, if needed.
                  Also, the Alarm will be temporarily disabled in order
                  to safely perform the update of the ALRMTIME register.
                  However, the device status will be restored. 
                  Note that the alarm date does not contain a year field.
 ********************************************************************/
BOOL RtccWriteAlrmDate(const rtccDate* pDt)
{
   WORD_VAL tempDayWDay ;
   WORD_VAL tempMonth ;

   BOOL    wasWrEn;
   BOOL    wasAlrm;

   if((MAX_MON < pDt->f.mon) || (MIN_MON > pDt->f.mon) || (MAX_MDAY < pDt->f.mday) || (MIN_MDAY > pDt->f.mday) || 
      (MAX_YEAR < pDt->f.year))
   {
       return FALSE;
   }

   tempMonth.byte.LB = pDt->f.mon;
   tempMonth.byte.HB = ALMDATEH;

   if(!(wasWrEn=mRtccIsWrEn()))
   {
       RtccWrOn();            // have to allow the WRTEN in order to write the new value
   }
   if((wasAlrm=mRtccIsAlrmEnabled()))
   {
       mRtccAlrmDisable();     // avoid spurious alarm interrupts
   }

   tempDayWDay.byte.LB =  pDt->f.mday;
   tempDayWDay.byte.HB = pDt->f.wday;


   ALMDATEL = tempDayWDay.Val;
   ALMDATEH = tempMonth.Val;

   if(wasAlrm)
   {
       mRtccAlrmEnable();
   }
   if(!wasWrEn)
   {
       mRtccWrOff();
   }

   return(TRUE);
}

/*********************************************************************
  Function:        void RtccWriteAlrmTime(const rtccTime* pTm)
 
  PreCondition:    pTm a valid rtccTime pointer having proper values:
                       *	sec:  BCD codification, 00-59 
                       *	min:  BCD codification, 00-59
                       *	hour: BCD codification, 00-24
 
  Input:           pTm - pointer to a constant rtccTime union
 
  Output:          None
 
  Side Effects:    None
 
  Overview:        The function sets the current time in the RTCC device.
 
  Note:            The write is successful only if Wr Enable is set.
                   The function will enable the write itself, if needed.
                   Also, the Alarm will be temporarily disabled in order
                   to safely perform the update of the ALRMTIME register.
                   However, the device status will be restored.
 ********************************************************************/
BOOL RtccWriteAlrmTime(const rtccTime* pTm)
{
   WORD_VAL tempSec ;
   WORD_VAL tempHourMin ;

   BOOL    wasWrEn;
   BOOL    wasAlrm;

   if((MAX_MIN < pTm->f.min)|| (MAX_SEC < pTm->f.sec) || (MAX_HOUR < pTm->f.hour))
   {
       return FALSE;
   }

   tempSec.byte.LB = ALMTIMEL;
   tempSec.byte.HB =pTm->f.sec;        // update the desired fields

   if(!(wasWrEn=mRtccIsWrEn()))
   {
       RtccWrOn();            // have to allow the WRTEN in order to write the new value
   }
   if((wasAlrm=mRtccIsAlrmEnabled()))
   {
       mRtccAlrmDisable();     // avoid spurious alarm interrupts
   }

   tempHourMin.byte.LB = pTm->f.min;
   tempHourMin.byte.HB = pTm->f.hour;

   ALMTIMEH = tempHourMin.Val;
   ALMTIMEL = tempSec.Val;

   if(wasAlrm)
   {
       mRtccAlrmEnable();
   }
   if(!wasWrEn)
   {
       mRtccWrOff();
   }

   return(TRUE);
}

/*********************************************************************
  Function:        BOOL RtccWriteAlrmTimeDate(const rtccTimeDate* pTD)
 
  PreCondition:    rtccTimeDate structure fields have to have proper values:
                       *	 sec:  BCD codification, 00-59 
                        *	min:  BCD codification, 00-59
                        *	hour: BCD codification, 00-24
                        *	wday: BCD codification, 00-06 
                        *	mday: BCD codification, 01-31
                        *	mon: BCD codification, 01-12
 
  Input:           pTD - pointer to a constant rtccTimeDate union
 
  Output:          TRUE '1' : If all the values are within range
                   FALSE '0' : If any value is out of above mentioned range.
 
  Side Effects:    None
 
  Overview:        The function sets the current alarm time and date in the RTCC device.
 
  Note:            Note that the alarm time does not contain a year field.
 ********************************************************************/
BOOL RtccWriteAlrmTimeDate(const rtccTimeDate* pTD)
{
    BOOL    wasWrEn;
    BOOL    wasAlrm;

   if((MAX_MIN < pTD->b[7]) || (MAX_SEC < pTD->b[6]) || (MAX_WDAY < pTD->b[5]) || (MAX_HOUR < pTD->b[4]) || 
      (MAX_MON < pTD->b[3]) || (MIN_MON > pTD->b[3]) || (MAX_MDAY < pTD->b[2]) || (MIN_MDAY > pTD->b[2]) )
   {
       return FALSE;
   }

   if(!(wasWrEn=mRtccIsWrEn()))
   {
       RtccWrOn();            // have to allow the WRTEN in order to write the new value
   }
   if((wasAlrm=mRtccIsAlrmEnabled()))
   {
       mRtccAlrmDisable();     // avoid spurious alarm interrupts
   }

   ALMTIMEL =pTD->w[0];  
   ALMTIMEH =pTD->w[1];
   ALMDATEL =pTD->w[2];
   ALMTIMEH =pTD->w[3];

   if(wasAlrm)
   {
       mRtccAlrmEnable();
   }
   if(!wasWrEn)
   {
       mRtccWrOff();
   }

   return(TRUE);
}

/***********************************************************************************
  Function:        BOOL RtccWriteDate(const rtccDate* pDt, BOOL di)
 
  PreCondition:    pDt is a valid rtccDate pointer having proper values:
                        *	wday: BCD codification, 00-06 
                        *	mday: BCD codification, 01-31
                        *	mon: BCD codification, 01-12
                        *	year: BCD codification, 00-99
 
  Input:           pDt - pointer to a constant rtccDate union
                   di - if interrupts need to be disabled
 
  Output:          TRUE '1' : If all the values are within range
                   FALSE '0' : If any value is out of above mentioned range.
 
  Side Effects:    None
 
  Overview:        The function updates the user supplied union/structure with
                   the current time and date of the RTCC device.
 
