SAKET71193/pic24fj256gb606/rtcc.c
  Note:            The write is successful only if Wr Enable is set.
                   The function will enable the write itself, if needed.
                   Also, the Alarm will be temporarily disabled and the
                   device will be stopped (On set to 0) in order
                   to safely perform the update of the RTC time register.
                   However, the device status will be restored.
                   Usually the disabling of the interrupts is desired, if the 
                   user has to have more precise control over the actual moment 
                   of the time setting.
 *************************************************************************************/
BOOL RtccWriteDate(const rtccDate* pDt , BOOL di)
{
   WORD_VAL tempDayWDay ;
   WORD_VAL tempYearMonth ;
 
   UINT8  CPU_IPL;

   BOOL        wasWrEn;
   BOOL        wasOn;
   BOOL        wasAlrm=FALSE;

   if((MAX_MON < pDt->f.mon) || (MIN_MON > pDt->f.mon) || (MAX_MDAY < pDt->f.mday) || (MIN_MDAY > pDt->f.mday) || 
      (MAX_YEAR < pDt->f.year))
   {
       return(FALSE);
   }

   tempDayWDay.byte.HB = pDt->f.mday;
   tempDayWDay.byte.LB = pDt->f.wday;
   
   tempYearMonth.byte.HB = pDt->f.year;
   tempYearMonth.byte.LB = pDt->f.mon;

   if(di)
   {
      /* Disable Global Interrupt */
      SET_AND_SAVE_CPU_IPL(CPU_IPL,7);
   }
   
   if(!(wasWrEn= mRtccIsWrEn()))
   {
       RtccWrOn();            // have to allow the WRTEN in order to write the new value
   }
   if((wasOn= mRtccIsOn()))
   {
       wasAlrm= mRtccIsAlrmEnabled();
       mRtccOff();         // turn module off before updating the time
   }


   DATEL =  tempDayWDay.Val;
   DATEH = tempYearMonth.Val;

   if(wasOn)
   {
       mRtccOn();
       if(wasAlrm)
       {
           mRtccAlrmEnable();
       }
   
       if(wasWrEn)
       {
           RtccWrOn();
       }
   }
   else
   {
       if(!wasWrEn)
       {
           mRtccWrOff();
       }
   }
   
   if(di)
   {
      /* Enable Global Interrupt */
      RESTORE_CPU_IPL(CPU_IPL);
   }
   

   return(TRUE);
}

/***********************************************************************************
  Function:        BOOL RtccWriteTime(const rtccTime* pTm, BOOL di)
 
  PreCondition:    pTm pointing to a valid rtccTime structure having proper values:
                        *	sec:  BCD codification, 00-59 
                        *	min:  BCD codification, 00-59
                       *	hour: BCD codification, 00-24
                       
  Input:           pTm - pointer to a constant rtccTime union
                   di - if interrupts need to be disabled
                   
  Output:          TRUE '1' : If all the values are within range
                   FALSE '0' : If any value is out of above mentioned range.
                   
  Side Effects:    None
  
  Overview:        The function updates the user supplied union/structure with
                   the current time and date of the RTCC device.
                   
  Note:            The write is successful only if Wr Enable is set.
                   The function will enable the write itself, if needed.
                   Also, the Alarm will be temporarily disabled and the
                   device will be stopped (On set to 0) in order
                   to safely perform the update of the RTC time register.
                   However, the device status will be restored.
                   Usually the disabling of the interrupts is desired, if the 
                   user has to have more precise control over the actual moment
                   of the time setting.
 ***********************************************************************************/
BOOL RtccWriteTime(const rtccTime* pTm , BOOL di)
{
   WORD_VAL tempHourMin ;
   WORD_VAL tempSec;
   UINT8  CPU_IPL;

   BOOL        wasWrEn;
   BOOL        wasOn;
   BOOL        wasAlrm=FALSE;

   if((MAX_MIN < pTm->f.min )|| (MAX_SEC < pTm->f.sec) || (MAX_HOUR < pTm->f.hour))
   {
       return(FALSE);
   }

   tempSec.byte.LB = TIMEL;        // update the desired fields
   tempSec.byte.HB = pTm->f.sec;        // update the desired fields
   
   if(di)
   {
      /* Disable Global Interrupt */
      SET_AND_SAVE_CPU_IPL(CPU_IPL,7);
   }
   
   if(!(wasWrEn= mRtccIsWrEn()))
   {
       RtccWrOn();            // have to allow the WRTEN in order to write the new value
   }
   if((wasOn= mRtccIsOn()))
   {
       wasAlrm= mRtccIsAlrmEnabled();
       mRtccOff();         // turn module off before updating the time
   }

   tempHourMin.byte.LB = pTm->f.min;
   tempHourMin.byte.HB = pTm->f.hour;

   TIMEH = tempHourMin.Val;
   TIMEL = tempSec.Val;

   if(wasOn)
   {
       mRtccOn();
       if(wasAlrm)
       {
           mRtccAlrmEnable();
       }
   
       if(wasWrEn)
       {
           RtccWrOn();
       }
   }
   else
   {
       if(!wasWrEn)
       {
           mRtccWrOff();
       }
   }
   
   if(di)
   {
      /* Enable Global Interrupt */
      RESTORE_CPU_IPL(CPU_IPL);
   }
   

   return(TRUE);
}

/*********************************************************************
  Function:        BOOL RtccWriteTimeDate(const rtccTimeDate* pTD , BOOL di)
 
  PreCondition:    rtccTimeDate structure fields have to have proper values:
                        *	sec:  BCD codification, 00-59 
                        *	min:  BCD codification, 00-59
                        *	hour: BCD codification, 00-24
                        *	wday: BCD codification, 00-06 
                        *	mday: BCD codification, 01-31
                        *	mon: BCD codification, 01-12
                        *	year: BCD codification, 00-99
 
  Input:           pTD - pointer to a rtccTimeDate union to store the current 
                         time and date 
                       di - if interrupts need to be disabled
                   
  Output:          TRUE '1' : If all the values are within range
                   FALSE '0' : If any value is out of above mentioned range.
 
  Side Effects:    None
 
  Overview:        The function updates the user supplied union/structure with
                   the current time and date of the RTCC device.
 
