SAKET71193/pic24fj256gb606/rtcc.c
  Note:            The write is successful only if Wr Enable is set.
                   The function will enable the write itself, if needed.
                   Also, the Alarm will be temporarily disabled and the
                   device will be stopped (On set to 0) in order
                   to safely perform the update of the RTC time register.
                   However, the device status will be restored.
                   Usually the disabling of the interrupts is desired, 
                   if the user has to have more precise control over the 
                   actual moment of the time setting.
 ********************************************************************/
BOOL RtccWriteTimeDate(const rtccTimeDate* pTD , BOOL di)
{
   BOOL        wasWrEn;
   BOOL        wasOn;
   BOOL        wasAlrm=FALSE;
   UINT8  CPU_IPL;

   if((MAX_MIN < pTD->b[7]) || (MAX_SEC < pTD->b[6]) || (MAX_WDAY < pTD->b[5]) || (MAX_HOUR < pTD->b[4]) || 
      (MAX_MON < pTD->b[3]) || (MIN_MON > pTD->b[3]) || (MAX_MDAY < pTD->b[2]) || (MIN_MDAY > pTD->b[2]) || 
      (MAX_YEAR < pTD->b[0]))
   {
       return(FALSE);
   }

   if(di)
   {
      /* Disable Global Interrupt */
      SET_AND_SAVE_CPU_IPL(CPU_IPL,7);
   }
   
   if(!(wasWrEn= mRtccIsWrEn()))
   {
       RtccWrOn();            // have to allow the WRTEN in order to write the new value
   }
   if((wasOn= mRtccIsOn()))
   {
       wasAlrm= mRtccIsAlrmEnabled();
       mRtccOff();         // turn module off before updating the time
   }

//        mRtccSetRtcPtr(3);

   TIMEL    = pTD->w[0];
   TIMEH    = pTD->w[1];
   ALMTIMEL = pTD->w[2];
   ALMTIMEH = pTD->w[3];   // update the RTCTIME value

   if(wasOn)
   {
       mRtccOn();
       if(wasAlrm)
       {
           mRtccAlrmEnable();
       }
   
       if(wasWrEn)
       {
           RtccWrOn();
       }
   }
   else
   {
       if(!wasWrEn)
       {
           mRtccWrOff();
       }
   }
   
   if(di)
   {
      /* Enable Global Interrupt */
      RESTORE_CPU_IPL(CPU_IPL);
   }
   

   return(TRUE);
}

 /*********************************************************************
 Function:        void RtccInitPowerControl(void)

 PreCondition:    None
                  
 Input:           config - Contents of the RTCCPWC control register.
 
 Output:          None
 
 Side Effects:    None
 
 Overview:        The function initializes the RTCC power control features.
                   
 Note:            None
 ********************************************************************/
void RtccInitPowerControl (unsigned int config)
{
   RTCCON1Lbits.PWCEN = config;
}
